src/main/resources/atscale-small/0035-req.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header><Session xmlns="urn:schemas-microsoft-com:xml-analysis" SessionId="2EF2676D-4D63-455D-A136-93C08062CB01"/></soap:Header><soap:Body><Discover xmlns="urn:schemas-microsoft-com:xml-analysis"><RequestType>MDSCHEMA_PROPERTIES</RequestType><Restrictions><RestrictionList><CUBE_NAME>AS Adventure Micro</CUBE_NAME><PROPERTY_NAME>MEMBER_VALUE</PROPERTY_NAME><PROPERTY_TYPE>5</PROPERTY_TYPE><PROPERTY_VISIBILITY>3</PROPERTY_VISIBILITY></RestrictionList></Restrictions><Properties><PropertyList><Catalog>ASAdventureMicro</Catalog><SafetyOptions>2</SafetyOptions><MdxMissingMemberMode>Error</MdxMissingMemberMode><DbpropMsmdOptimizeResponse>9</DbpropMsmdOptimizeResponse><DbpropMsmdActivityID>BF00EFBA-6825-45D4-AD5D-F26EB2C668E6</DbpropMsmdActivityID><DbpropMsmdRequestID>C4871363-31AA-4139-B1C5-ACBD0DB085D3</DbpropMsmdRequestID><LocaleIdentifier>1033</LocaleIdentifier><DbpropMsmdMDXCompatibility>1</DbpropMsmdMDXCompatibility></PropertyList></Properties></Discover></soap:Body></soap:Envelope>